In [1]:
import pandas as pd

In [6]:
temperature = pd.Series([20, 19, 30, 28, 32 ])
print('max temp:', temperature.max(),' min temp:', temperature.min())

max temp: 32  min temp: 19

In [9]:
temperature.index = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri'] # aligns indexed strings to the temperatures
print(temperature)

Mon    20
Tue    19
Wed    30
Thu    28
Fri    32
dtype: int64

In [20]:
## dataframe

d = {
    "name": ["cup", "bottle", "juice"],
    "price": [1, 10, 3],
    "quantity": [3, 0, 9],
}
df = pd.DataFrame(d)
print(df)

     name  price  quantity
0     cup      1         3
1  bottle     10         0
2   juice      3         9

In [29]:
df['total value'] = df['price'] * df['quantity']
print(df)

     name  price  quantity  total value
0     cup      1         3            3
1  bottle     10         0            0
2   juice      3         9           27

In [31]:
# reading from a csv

df = pd.read_csv("students_with_scores.csv")

In [35]:
df.head(8)

       Name      School Grade  Score
0  Student1   West High     A     92
1  Student2  South High     F      6
2  Student3  North High     D     64
3  Student4   West High     B     88
4  Student5   West High     A     96
5  Student6  South High     A     91
6  Student7  North High     B     83
7  Student8  North High     C     78

In [34]:
df.tail()

         Name      School Grade  Score
15  Student16  North High     C     76
16  Student17  South High     A     97
17  Student18  South High     C     72
18  Student19  South High     C     70
19  Student20   West High     A     93

In [37]:
# dataset shape
shape = df.shape
print(shape)

(20, 4)

In [39]:
# columns
columns = df.columns
print(columns)

Index(['Name', 'School', 'Grade', 'Score'], dtype='object')

In [48]:
# stats summary
describe = df.describe() # only picks up all the numerical values
print(describe)
aggr = df.agg
print(aggr)

           Score
count  20.000000
mean   80.050000
std    19.789617
min     6.000000
25%    77.500000
50%    83.000000
75%    91.250000
max    99.000000
<bound method DataFrame.aggregate of          Name      School Grade  Score
0    Student1   West High     A     92
1    Student2  South High     F      6
2    Student3  North High     D     64
3    Student4   West High     B     88
4    Student5   West High     A     96
5    Student6  South High     A     91
6    Student7  North High     B     83
7    Student8  North High     C     78
8    Student9   West High     B     81
9   Student10   East High     B     89
10  Student11   West High     C     78
11  Student12   West High     A     99
12  Student13   West High     B     84
13  Student14   West High     B     81
14  Student15  South High     B     83
15  Student16  North High     C     76
16  Student17  South High     A     97
17  Student18  South High     C     72
18  Student19  South High     C     70
19  Student20   West High     A     93>

In [49]:
# info on the datatypes and missing values
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    20 non-null     object
 1   School  20 non-null     object
 2   Grade   20 non-null     object
 3   Score   20 non-null     int64
dtypes: int64(1), object(3)
memory usage: 772.0+ bytes
None

In [67]:
## Indexing / slicing: difference between loc vs iloc

#.loc -> uses names / labels to get the locations and not by indexes / positions
#.iloc-> uses numbers to do the same 

## single column
# print(df["Name"])

## multiple columns
#print(df[["Name","School"]])

##row by label
print(df.loc[0,'Name']) # 0 here is the first record in the name column

## specific rows and columns
print(df.loc[0:3,["Name", "School"]]) # it's using the

Student1
       Name      School
0  Student1   West High
1  Student2  South High
2  Student3  North High
3  Student4   West High

In [66]:
## .iloc
#
print(df.iloc[0:3])

       Name      School Grade  Score
0  Student1   West High     A     92
1  Student2  South High     F      6
2  Student3  North High     D     64

In [96]:
# Names and scored of first 3 students
# print(df.loc[0:2,["Name", "Score"]])

# all students from a specific school
# print(df.loc[df["School"] == "West High"])

# Scored of the last 2 students
print(df.iloc[-2]["Score"])

# sort by descending order
print(df.sort_values(by = "Score", ascending=False))

# filter students with scores above 80
print(df[df["Score"] > 80])

70
         Name      School Grade  Score
11  Student12   West High     A     99
16  Student17  South High     A     97
4    Student5   West High     A     96
19  Student20   West High     A     93
0    Student1   West High     A     92
5    Student6  South High     A     91
9   Student10   East High     B     89
3    Student4   West High     B     88
12  Student13   West High     B     84
6    Student7  North High     B     83
14  Student15  South High     B     83
13  Student14   West High     B     81
8    Student9   West High     B     81
7    Student8  North High     C     78
10  Student11   West High     C     78
15  Student16  North High     C     76
17  Student18  South High     C     72
18  Student19  South High     C     70
2    Student3  North High     D     64
1    Student2  South High     F      6
         Name      School Grade  Score
0    Student1   West High     A     92
3    Student4   West High     B     88
4    Student5   West High     A     96
5    Student6  South High     A     91
6    Student7  North High     B     83
8    Student9   West High     B     81
9   Student10   East High     B     89
11  Student12   West High     A     99
12  Student13   West High     B     84
13  Student14   West High     B     81
14  Student15  South High     B     83
16  Student17  South High     A     97
19  Student20   West High     A     93